In [1]:
import pandas as pd

In [3]:
data = pd.read_csv('/Users/minguinho/Downloads/데이콘/pandas 입문/Data/data02.csv') # 이전 시간에 만들었던 데이터 불러오기 
data

   도시      인구수
0  서울  9741381
1  부산  3416918
2  인천  2925967
3  대구  2453041
4  대전  1525849
5  광주  1496172
6  수원  1193894
7  울산  1147037
8  고양  1068641
9  용인  1061440

In [4]:
# 새로운 데이터를 컬럼에 추가 -> 특징 추가? 
man = [4757642, 1680933, 1472081, 1218326, 765718, 745122, 601097, 589233, 523803, 526824]
woman = [4984229, 1735985, 1453886, 1234715, 760131, 751050, 592797, 557804, 544838, 534617]

In [5]:
# 이런식으로 추가할 수 있다. 이거 그 뭐냐 파이썬 클래스 초기화할 때 클래스 변수 추가하는거 보는 느낌이 든다. 없던 종류의 원소인데 이런식으로 추가하는거지. 
data['남자'] = man
data['여자'] = woman
data

   도시      인구수       남자       여자
0  서울  9741381  4757642  4984229
1  부산  3416918  1680933  1735985
2  인천  2925967  1472081  1453886
3  대구  2453041  1218326  1234715
4  대전  1525849   765718   760131
5  광주  1496172   745122   751050
6  수원  1193894   601097   592797
7  울산  1147037   589233   557804
8  고양  1068641   523803   544838
9  용인  1061440   526824   534617

In [6]:
# 인구수 종합 열(로우) 추가
data.sum() # 데이터 요소를 다 더한 로우를 보여준다. 도시 이름도 다 더해져있고 인구도 다 더해져있음

도시     서울부산인천대구대전광주수원울산고양용인
인구수                26030340
남자                 12880779
여자                 13150052
dtype: object

In [7]:
# loc[]로 추가. 추가할 로우의 인덱스 입력 후 값을 추가. 역시 클래스의 초기화 장면을 연상케 한다. 
data.loc[10] = data.sum()
data

                      도시       인구수        남자        여자
0                     서울   9741381   4757642   4984229
1                     부산   3416918   1680933   1735985
2                     인천   2925967   1472081   1453886
3                     대구   2453041   1218326   1234715
4                     대전   1525849    765718    760131
5                     광주   1496172    745122    751050
6                     수원   1193894    601097    592797
7                     울산   1147037    589233    557804
8                     고양   1068641    523803    544838
9                     용인   1061440    526824    534617
10  서울부산인천대구대전광주수원울산고양용인  26030340  12880779  13150052

In [8]:
# 특정값 변경. loc[]로 변경 가능
data.loc[10, '도시'] = '총합' # 10번 째 특성(로우)의 '도시'열에 해당하는 값을 '총합'으로 변경
data

    도시       인구수        남자        여자
0   서울   9741381   4757642   4984229
1   부산   3416918   1680933   1735985
2   인천   2925967   1472081   1453886
3   대구   2453041   1218326   1234715
4   대전   1525849    765718    760131
5   광주   1496172    745122    751050
6   수원   1193894    601097    592797
7   울산   1147037    589233    557804
8   고양   1068641    523803    544838
9   용인   1061440    526824    534617
10  총합  26030340  12880779  13150052

In [11]:
data.to_csv('/Users/minguinho/Downloads/데이콘/pandas 입문/Data/data03.csv', index=False)